Repository: onesmalldog/TUIKit_iOS
Catalog: live/Resources/Localized/TUILiveKitLocalized.xcstrings
Source language: en
Languages: ar, ja, zh_hans, zh_hant

# common_stream_categories_teach
source: Knowledge Teaching
ar: تعليم المعرفة
ja: 知識教育
zh_hans: 知识教学
zh_hant: 知識教學

# common_stream_privacy_status_default
source: Public
ar: عام
ja: 公共
zh_hans: 公开
zh_hant: 公開

# common_stream_privacy_status_privacy
source: Privacy
ar: خاص
ja: プライバシー
zh_hans: 隐私
zh_hant: 隱私

# common_text_cancel_link_mic_apply
source: Cancel application for link mic
ar: إلغاء طلب ربط الميكروفون
ja: 電話に接続するためのアプリケーションをキャンセルします
zh_hans: 取消连麦申请
zh_hant: 取消連麥申請

# common_text_close_link_mic
source: End Link
ar: إنهاء الربط
ja: 分隊の終わり
zh_hans: 结束连麦
zh_hant: 結束連麥

# common_text_link_mic_audio
source: Apply for audio link
ar: التقدم لربط الصوت
ja: 音声接続を申請します
zh_hans: 申请语音连麦
zh_hant: 申請語音連麥

# common_text_link_mic_selector
source: connect upon host's approval
ar: الاتصال بعد موافقة المضيف
ja: 接続方法を選択すると、アンカーは接続することに同意します
zh_hans: 选择连麦方式，主播同意后接通
zh_hant: 選擇連麥方式，主播同意後接通

# common_text_link_mic_video
source: Apply for video link
ar: التقدم لربط الفيديو
ja: ビデオリンクを申請してください
zh_hans: 申请视频连麦
zh_hant: 申請視頻連麥

# common_tips_apply_link_mic
source: The screen effect will automatically take effect after connecting
ar: سيتم تطبيق تأثير الشاشة تلقائياً بعد الاتصال
ja: 画面効果がオンになった後、自動的に有効になります
zh_hans: 接通后画面效果将自动生效
zh_hant: 接通後畫面效果將自動生效

# common_title_link_mic_selector
source: Choose Link Mode
ar: اختر وضع الربط
ja: 接続する方法を選択してください
zh_hans: 选择连麦方式
zh_hant: 選擇連麥方式

# common_title_link_video_settings
source: Adjust the video link screen
ar: ضبط شاشة ربط الفيديو
ja: ビデオ接続画面を調整します
zh_hans: 调整视频连麦画面
zh_hant: 調整視頻連麥畫面

# common_toast_apply_link_mic
source: You have submitted a link mic request, please wait for the author approval
ar: لقد قدمت طلب ربط الميكروفون، يرجى انتظار موافقة المذيع
ja: あなたは電気通信申請書を提出しました、アンカーが同意するのを待ってください
zh_hans: 你提交了连麦申请，请等待主播同意
zh_hant: 你提交了連麥申請，請等待主播同意

# common_unfollow_anchor
source: Unfollow
ar: إلغاء المتابعة
ja: 解除してください
zh_hans: 取消关注
zh_hant: 取消關注

# common_video_config
source: Video
ar: فيديو
ja: ビデオパラメーター
zh_hans: 视频参数
zh_hant: 視頻參數

# common_video_params
source: Video Config
ar: إعدادات الفيديو
ja: ビデオパラメーター
zh_hans: 视频参数
zh_hant: 視頻參數

# common_video_settings_item_beauty
source: Beauty
ar: جمال
ja: 美化します
zh_hans: 美颜
zh_hant: 美顏

# common_video_settings_item_flip
source: Flip
ar: قلب
ja: フリップ
zh_hans: 翻转
zh_hant: 翻轉

# common_video_settings_item_mirror
source: Mirror
ar: مرآة
ja: 鏡
zh_hans: 镜像
zh_hant: 鏡像

# common_video_settings_item_pip
source: Pip
ar: صورة داخل صورة
ja: ピクチャー・イン・ピクチャー
zh_hans: 画中画
zh_hant: 畫中畫

# common_pip_toggle
source: Pip Toggle
ar: تبديل صورة داخل صورة
ja: ピクチャーインピクチャーの切り替え
zh_hans: 画中画开关
zh_hant: 畫中畫開關

# common_pip_toggle_description
source: After enabling, the app will automatically enter picture-in-picture mode when moved to the background
ar: بعد التفعيل، سيدخل التطبيق تلقائياً وضع صورة داخل صورة عند الانتقال للخلفية
ja: オンにすると、アプリがバックグラウンドに移動したときに自動的にピクチャーインピクチャーモードに入ります
zh_hans: 开启后，应用退后台时自动进入画中画模式
zh_hant: 啟用後，應用退到後台時會自動進入畫中畫模式

# common_voiceroom_empty_view
source: No users in the seat, go to invite
ar: لا يوجد مستخدمون في المقعد، اذهب للدعوة
ja: マイクにはユーザーがいません。
zh_hans: 麦位没有用户，去邀请
zh_hant: 麥位沒有用戶，去邀請

# common_voiceroom_invite
source: Invite
ar: دعوة
ja: 招待する
zh_hans: 邀请
zh_hant: 邀請

# common_voiceroom_invite_seat_canceled
source: Seat invitation has been canceled
ar: تم إلغاء دعوة المقعد
ja: Shangmaiへの招待状がキャンセルされました
zh_hans: 上麦邀请已被取消
zh_hant: 上麥邀請已被取消

# common_voiceroom_invite_seat_rejected
source: Seat invitation has been rejected
ar: تم رفض دعوة المقعد
ja: Shangmaiへの招待状が拒否されました
zh_hans: 上麦邀请已被拒绝
zh_hant: 上麥邀請已被拒絕

# common_voiceroom_invite_seat_timeout
source: Seat invitation timeout
ar: انتهت مهلة دعوة المقعد
ja: Shangmaiへの招待状がタイムアウトしました
zh_hans: 上麦邀请超时
zh_hant: 上麥邀請超時

# common_voiceroom_lock
source: Lock Seat
ar: قفل المقعد
ja: 位置をロックします
zh_hans: 锁定麦位
zh_hant: 鎖定麥位

# common_voiceroom_mute_seat
source: Mute
ar: كتم الصوت
ja: ミュート
zh_hans: 静音
zh_hant: 靜音

# common_voiceroom_need_agree
source: Require owner's consent to speak
ar: يتطلب موافقة صاحب الغرفة للتحدث
ja: 住宅所有者は同意する必要があります
zh_hans: 上麦需要房主同意
zh_hant: 上麥需要房主同意

# common_voiceroom_receive_seat_invitation
source: xxx invites you to take seat
ar: xxx يدعوك لأخذ مقعد
ja: xxxマイへの招待状を送信します
zh_hans: xxx 向你发来上麦邀请
zh_hant: xxx 向你發來上麥邀請

# common_voiceroom_take_seat
source: Take Seat
ar: أخذ مقعد
ja: 小麦に行きます
zh_hans: 上麦
zh_hant: 上麥

# common_voiceroom_take_seat_rejected
source: Take seat application has been rejected
ar: تم رفض طلب أخذ المقعد
ja: MAIの申請は拒否されました
zh_hans: 上麦申请被拒绝
zh_hant: 上麥申請被拒絕

# common_voiceroom_take_seat_timeout
source: Take seat application timeout
ar: انتهت مهلة طلب أخذ المقعد
ja: MSMEタイムアウトを申請します
zh_hans: 上麦申请超时
zh_hant: 上麥申請超時

# common_voiceroom_unlock
source: Unlock Seat
ar: فتح قفل المقعد
ja: マイクのロックを解除します
zh_hans: 解锁麦位
zh_hant: 解鎖麥位

# common_voiceroom_unmuted_seat
source: Unmute
ar: إلغاء كتم الصوت
ja: ミュート
zh_hans: 解除静音
zh_hant: 解除靜音

# live_barrage_agree
source: Agree
ar: موافق
ja: 同意する
zh_hans: 同意
zh_hant: 同意

# live_barrage_btn_send
source: Send
ar: إرسال
ja: 送信
zh_hans: 发送
zh_hant: 發送

# live_choose_music
source: Choose Music
ar: اختر الموسيقى
ja: 音楽を選択します
zh_hans: 选择音乐
zh_hant: 選擇音樂

# live_cohost_application_expired
source: The application has expired.
ar: انتهت صلاحية التطبيق
ja: この申請は無効です
zh_hans: 该申请已失效
zh_hant: 該申請已失效

# live_failed_to_enter_room
source: Failed to enter room
ar: فشل دخول الغرفة
ja: 部屋に入ることができませんでした
zh_hans: 进房失败
zh_hant: 進房失敗

# live_invalid_userId
source: Invalid userId
ar: معرف مستخدم غير صالح
ja: 違法なユーザーID
zh_hans: 非法的userId
zh_hant: 非法的userId

# live_music_pitch
source: Music Pitch
ar: نغمة الموسيقى
ja: 上下にミュージカル
zh_hans: 音乐升降调
zh_hant: 音樂升降調

# common_video_status
source: Video Status
ar: حالة الفيديو
ja: ビデオステータス
zh_hans: 视频状态
zh_hant: 視頻狀態

# common_audio_status
source: Audio Status
ar: حالة الصوت
ja: オーディオステータス
zh_hans: 音频状态
zh_hant: 音頻狀態

# common_device_temp
source: Device Temperature
ar: درجة حرارة الجهاز
ja: 機器の温度
zh_hans: 设备温度
zh_hant: 設備溫度

# common_wifi_or_mobile_network
source: Wi-Fi/Mobile Network
ar: Wi-Fi/شبكة الجوال
ja: Wi-Fi/モバイルネットワーク
zh_hans: Wi-Fi/移动网络
zh_hant: Wi-Fi/移動網絡

# common_video_stream_smooth
source: Smooth streaming
ar: بث سلس
ja: ブロードキャスト画面は滑らかです
zh_hans: 开播画面流畅
zh_hant: 開播畫面流暢

# common_video_stream_freezing
source: Freezing streaming
ar: بث متجمد
ja: ブロードキャストの画面が立ち往生しています
zh_hans: 开播画面卡顿
zh_hant: 開播畫面卡頓

# common_video_capture_closed
source: Video capture disabled
ar: تم تعطيل التقاط الفيديو
ja: ビデオコレクションは閉鎖されています
zh_hans: 视频采集已关闭
zh_hant: 視頻採集已關閉

# common_audio_tips_proper_volume
source: Proper volume ensures good viewing experience
ar: مستوى الصوت المناسب يضمن تجربة مشاهدة جيدة
ja: 適切なボリュームは、良い視聴体験を保証します
zh_hans: 适当音量确保良好观看体验
zh_hant: 適當音量確保良好觀看體驗

# common_audio_tips_regular_checks
source: Regular checks ensure good viewing experience
ar: الفحوصات المنتظمة تضمن تجربة مشاهدة جيدة
ja: 定期的な検査により、良い視聴体験が保証されます
zh_hans: 定期检查确保良好观看体验
zh_hant: 定期檢查確保良好觀看體驗

# common_network_switch_tips
source: Avoid frequent network switching
ar: تجنب التبديل المتكرر للشبكة
ja: 頻繁にネットワークの切り替えを避けてください
zh_hans: 避免频繁切换网络
zh_hant: 避免頻繁切換網絡

# common_live_info
source: Live Information
ar: معلومات البث
ja: ライブブロードキャスト情報
zh_hans: 直播信息
zh_hant: 直播資訊

# common_rtt
source: RTT
ar: زمن الذهاب والإياب
ja: 往復遅延
zh_hans: 往返延时
zh_hant: 往返延時

# common_down_loss
source: Down Loss
ar: فقدان التنزيل
ja: 下流のパケットが失われました
zh_hans: 下行丢包
zh_hant: 下行丟包

# common_up_loss
source: Up Loss
ar: فقدان الرفع
ja: アップリンクパケット損失
zh_hans: 上行丢包
zh_hant: 上行丟包

# common_normal
source: normal
ar: طبيعي
ja: 普通
zh_hans: 正常
zh_hant: 正常

# common_close
source: close
ar: إغلاق
ja: 閉鎖
zh_hans: 关闭
zh_hant: 關閉

# common_exception
source: exception
ar: استثناء
ja: 異常な
zh_hans: 异常
zh_hant: 異常

# common_excellent
source: excellent
ar: ممتاز
ja: 素晴らしい
zh_hans: 优秀
zh_hant: 優秀

# common_good
source: good
ar: جيد
ja: 良い
zh_hans: 良好
zh_hant: 良好

# common_poor
source: poor
ar: ضعيف
ja: 貧しい
zh_hans: 较差
zh_hant: 較差

# common_bad
source: bad
ar: سيء
ja: 違い
zh_hans: 差
zh_hant: 差

# common_verybad
source: veryBad
ar: سيء جداً
ja: 非常に悪い
zh_hans: 非常差
zh_hant: 非常差

# common_down
source: down
ar: منقطع
ja: 切断します
zh_hans: 断开
zh_hant: 斷開

# common_audio_mode_default
source: Default
ar: افتراضي
ja: デフォルトモード
zh_hans: 默认模式
zh_hant: 預設模式

# common_audio_mode_speech
source: Speech
ar: كلام
ja: 音声モード
zh_hans: 人声模式
zh_hant: 人聲模式

# common_audio_mode_music
source: Music
ar: الموسيقى
ja: 音楽モード
zh_hans: 音乐模式
zh_hant: 音樂模式

# common_device_temp_fair
source: fair
ar: معتدل
ja: 微熱
zh_hans: 轻微发热
zh_hant: 輕微發熱

# common_device_temp_serious
source: serious
ar: خطير
ja: 重度の発熱
zh_hans: 严重发热
zh_hant: 嚴重發熱

# common_network_bad_tips
source: Network lag detected suggestions
ar: تم اكتشاف تأخر في الشبكة، اقتراحات
ja: 現在のネットワークはutter音を立てていますが、お勧めします
zh_hans: 当前网络卡顿，建议
zh_hant: 網路狀態不佳，建議

# common_switch_network
source: Switch Network
ar: تبديل الشبكة
ja: スイッチネットワーク
zh_hans: 切换网络
zh_hant: 切換網路

# common_wait_connection
source: Conn Wait
ar: انتظار الاتصال
ja: 接続を待っています
zh_hans: 等待连线
zh_hant: 等待連線

# common_apply_connection
source: Conn Join
ar: الانضمام للاتصال
ja: 接続を申請します
zh_hans: 申请连线
zh_hant: 申請連線

# common_template_select
source: Template:
ar: القالب:
ja: テンプレートの選択：
zh_hans: 模板选择:
zh_hant: 模板選擇:

# common_template_dynamic_grid
source: Dynamic grid layout
ar: تخطيط شبكة ديناميكي
ja: 動的グリッド
zh_hans: 动态宫格
zh_hant: 動態宮格

# common_template_dynamic_float
source: Dynamic float layout
ar: تخطيط عائم ديناميكي
ja: フローティングウィンドウ
zh_hans: 浮动小窗
zh_hant: 浮動小窗

# common_template_static_grid
source: Static grid layout
ar: تخطيط شبكة ثابت
ja: 静的グリッド
zh_hans: 静态宫格
zh_hant: 靜態宮格

# common_template_static_float
source: Static float layout
ar: تخطيط عائم ثابت
ja: 固定ウィンドウ
zh_hans: 固定小窗
zh_hant: 固定小窗

# common_template_layout_settings
source: Layout settings
ar: إعدادات التخطيط
ja: レイアウト設定
zh_hans: 布局设置
zh_hant: 佈局設定

# common_template_layout_co_guest
source: Layout co-guest
ar: تخطيط الضيف المشترك
ja: オーディエンスのレイアウトでさえ
zh_hans: 连观众布局
zh_hant: 連觀眾佈置

# common_template_layout_co_host
source: Layout co-host
ar: تخطيط المضيف المشترك
ja: アンカーPKレイアウト
zh_hans: 主播PK布局
zh_hant: 主播PK佈局

# common_template_layout
source: Layout
ar: التخطيط
ja: レイアウト
zh_hans: 布局
zh_hant: 佈局

# karaoke_chat_room
source: Chat Room
ar: غرفة الدردشة
ja: チャットルーム
zh_hans: 聊天室
zh_hant: 聊天室

# karaoke_ktv_room
source: KTV Room
ar: غرفة KTV
ja: KTVルーム
zh_hans: KTV
zh_hant: KTV

# common_video_settings
source: Video settings
ar: إعدادات الفيديو
ja: ビデオ設定
zh_hans: 视频设置
zh_hant: 視頻設置

# live_video_resolution
source: Resolution
ar: الدقة
ja: 解像度
zh_hans: 清晰度
zh_hant: 清晰度

# live_video_reduce_resolution
source: Reduce resolution
ar: تقليل الدقة
ja: 解像度を下げる
zh_hans: 降低清晰度
zh_hant: 降低清晰度

# live_video_resolution_changed
source: resolution changed to
ar: تم تغيير الدقة إلى
ja: 解像度が切り替わりました
zh_hans: 清晰度已切换至
zh_hant: 清晰度已切換至

# common_template_601_ui_exception_toast
source: This layout template may display abnormally on certain models. It is recommended to change to another layout template.
ar: قد يُعرض قالب التخطيط هذا بشكل غير طبيعي على بعض الطرازات. يُنصح بالتغيير إلى قالب تخطيط آخر.
ja: このレイアウトテンプレートは、一部の機種で正常に表示されない場合があります。別のレイアウトテンプレートに変更することをお勧めします。
zh_hans: 该布局模板在特定机型上会显示异常，建议更换其他布局模板
zh_hant: 此佈局模板在特定機型上會顯示異常，建議更換其他佈局模板

# seat_locked
source: Locked
ar: مقفل
ja: ロックされています
zh_hans: 已锁定
zh_hant: 已鎖定

# seat_unlocked
source: UnLock Seat
ar: فتح قفل المقعد
ja: ロックを解除します
zh_hans: 解锁麦位
zh_hant: 解鎖麦位

# seat_no_guest
source: No guests
ar: لا يوجد ضيوف
ja: まだゲストはいません
zh_hans: 暂无嘉宾
zh_hant: 暫無嘉賓

# seat_in_battle
source: In Battle
ar: في المنافسة
ja: 戦闘中
zh_hans: 正在PK
zh_hant: 正在PK

# seat_in_connection
source: In Connection
ar: قيد الاتصال
ja: 接続中
zh_hans: 正在连线
zh_hant: 正在連線

# seat_cancel_invite
source: Cancel invite
ar: إلغاء الدعوة
ja: 招待をキャンセルします
zh_hans: 取消邀请
zh_hant: 取消邀請

# seat_request_battle
source: Request Battle
ar: طلب المنافسة
ja: 戦闘を開始します
zh_hans: 发起PK
zh_hant: 發起PK

# seat_request_host
source: Invite Host
ar: دعوة المضيف
ja: ホストを招待します
zh_hans: 邀请连线
zh_hant: 邀請連線

# seat_invite_battle
source: Invite Battle
ar: دعوة للمنافسة
ja: 戦闘を開始します
zh_hans: 邀请PK
zh_hant: 邀請PK

# seat_repeat_invite_tips
source: Inviting others you can withdraw the invitation and send a new one
ar: دعوة الآخرين، يمكنك سحب الدعوة وإرسال دعوة جديدة
ja: 他の人を招待中です。申請を撤回してから再度招待できます
zh_hans: 正在邀请他人，可撤回申请后再发起邀请
zh_hant: 正在邀請他人，可撤回申請後再發起邀請

# seat_end_Battle
source: End Battle
ar: إنهاء المنافسة
ja: 戦闘を終了します
zh_hans: 结束PK
zh_hant: 結束PK

# seat_in_pk
source: In PK
ar: في المنافسة
ja: PK中
zh_hans: PK中
zh_hant: PK中

# live_end_live_tips
source: Are you sure you want to End Live?
ar: هل أنت متأكد أنك تريد إنهاء البث؟
ja: 終了することを確認しますか？
zh_hans: 确定要结束直播吗？
zh_hant: 确定要結束直播嗎？

# live_exit_live_tips
source: Are you sure you want to Exit Live?
ar: هل أنت متأكد أنك تريد الخروج من البث؟
ja: 退出することを確認しますか？
zh_hans: 确定要退出直播间吗？
zh_hant: 确定要退出直播間嗎？

# live_cancel_request
source: xxx canceled request
ar: xxx ألغى الطلب
ja: xxxが申請をキャンセルしました
zh_hans: xxx 取消了申请
zh_hant: 取消了申請

# mirror_type_auto
source: Auto
ar: تلقائي
ja: 自動
zh_hans: 自动
zh_hant: 自動

# mirror_type_enable
source: Enable
ar: تفعيل
ja: 有効
zh_hans: 开启
zh_hant: 開啟

# mirror_type_disable
source: Disable
ar: تعطيل
ja: 無効
zh_hans: 关闭
zh_hant: 關閉

# mirror_type_change_to
source: Change to xxx
ar: التغيير إلى xxx
ja: xxxに変更します
zh_hans: 切换为xxx
zh_hant: 切換為xxx

# common_remove
source: Remove
ar: إزالة
ja: 取り除く
zh_hans: 移除
zh_hant: 移除

# common_host_kick_user_after_connect
source: The connection is successful. Users beyond the first 6 seats have been removed.
ar: تم الاتصال بنجاح. تمت إزالة المستخدمين خارج أول 6 مقاعد.
ja: 接続に成功しました。先着6席以外のユーザーはマイクを降りました。
zh_hans: 连线成功。前 6 个麦位以外的用户已被移除。如需互动，请重新邀请。
zh_hant: 連線成功。前 6 個麥位以外的使用者已被移除。如需互動，請重新邀請。

# common_audience_kicked_re_apply
source: The connection only displays the first 6 seats. You have been removed.
ar: يعرض الاتصال أول 6 مقاعد فقط. تمت إزالتك.
ja: 接続は先着6席のみ表示されます。あなたはマイクから降ろされました。
zh_hans: 连线仅显示前 6 个麦位。您已被移除，如有需要请重新申请上麦。
zh_hant: 連線僅顯示前 6 個麥位。您已被移除，如有需要請重新申請上麥。

# common_back_seats_occupied
source: Cannot connect when back 4 seats occupied
ar: لا يمكن الاتصال عندما تكون المقاعد الأربعة الخلفية مشغولة
ja: 後方4席が占有されており、接続できません
zh_hans: 后四个麦位已有用户，无法进行连线/PK
zh_hant: 後四個麥位有人，無法連線

# common_game_live
source: Game Live
ar: بث مباشر للألعاب
ja: スマホゲーム実況
zh_hans: 手游直播
zh_hant: 手遊直播

# common_live_game
source: Live Game
ar: بث مباشر للعبة
ja: ゲームライブ配信中
zh_hans: 正在游戏直播中
zh_hant: 遊戲直播中

# common_gift_combo
source: Combo
ar: متتالي
ja: コンボ
zh_hans: 连击
zh_hant: 連擊

# common_end_live_by_server
source: The live stream was shut down due to violations of regulations.
ar: تم إيقاف البث المباشر بسبب انتهاكات للوائح.
ja: 規則違反のため、ライブ配信は停止されました。
zh_hans: 直播内容违规已被强制关播
zh_hant: 直播內容違規已強制關播

# common_go_to_enable
source: Go to Enable
ar: الذهاب للتفعيل
ja: 有効にする
zh_hans: 去开启
zh_hant: 去開啟

# common_live_screen
source: Live Screen
ar: بث الشاشة مباشرةً
ja: 画面をライブ配信
zh_hans: 直播屏幕
zh_hant: 直播螢幕

# common_select_app_to_live
source: Select App and Start Live
ar: بث مباشر للعبةاختر التطبيق وابدأ البث المباشر
ja: アプリを選択してライブを開始
zh_hans: 选择应用并开始直播
zh_hant: 選擇應用並開始直播
